#*****************************************************************************
# This script is used to synthesize the RISC-V before backannotation
#*****************************************************************************
sh rm -r ./WORK
sh mkdir WORK
sh mkdir logs
sh mkdir reports
sh mkdir logs/RISC_V_v2
sh mkdir reports/RISC_V_v2
sh mkdir reports/RISC_V_v2/ddc
sh mkdir reports/RISC_V_v2/netlist

#to preserve rtl names in the netlist for power consumption estimation.
set power_preserve_rtl_hier_names true

#analyze all possible files contained in the src folder 
analyze -library WORK -autoread -format vhdl {../../src/components/common}
analyze -library WORK -format vhdl {../../src/components/control/ALU_CTRL_v2.vhd}
analyze -library WORK -format vhdl {../../src/components/control/CU.vhd}
analyze -library WORK -format vhdl {../../src/components/control/HDU.vhd}
analyze -library WORK -autoread -format vhdl {../../src/components/control/BPU}
analyze -library WORK -format vhdl {../../src/components/control/BPU/BPU_32bit/BPU.vhd}
analyze -library WORK -format vhdl {../../src/components/datapath/ABS_VAL.vhd}
analyze -library WORK -format vhdl {../../src/components/datapath/ALU_v2.vhd}
analyze -library WORK -format vhdl {../../src/components/datapath/BRANCH_COMP.vhd}
analyze -library WORK -format vhdl {../../src/components/datapath/IMM_GEN.vhd}
analyze -library WORK -format vhdl {../../src/components/datapath/INCREMENTER.vhd}
analyze -library WORK -format vhdl {../../src/components/datapath/JMP_ADD.vhd}
analyze -library WORK -format vhdl {../../src/components/datapath/PIPE_EX_MEM.vhd}
analyze -library WORK -format vhdl {../../src/components/datapath/PIPE_ID_EX.vhd}
analyze -library WORK -format vhdl {../../src/components/datapath/PIPE_IF_ID.vhd}
analyze -library WORK -format vhdl {../../src/components/datapath/PIPE_MEM_WB.vhd}
analyze -library WORK -format vhdl {../../src/components/datapath/REG_FILE.vhd}
analyze -library WORK -format vhdl {../../src/RISC_V_v2.vhd}

#elaborate top entity
elaborate RISC_V_v2 -architecture rtl -library WORK > ./logs/RISC_V_v2/elaborate_v2.txt
link > ./logs/RISC_V_v2/link_v2.txt

#**************** CONSTRAINT THE SYNTHESIS ****************#
# setting design constrains
create_clock -name MY_CLK -period 10 CLK
set_dont_touch_network MY_CLK
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] clk]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set_load $OLOAD [all_outputs]

# compiling the RISC_V_v1
compile -exact_map > ./logs/RISC_V_v2/compile_v2.txt

# producing output for simulation
ungroup -all -flatten
change_names -hierarchy -rules verilog
write -f verilog -hierarchy -output ./reports/RISC_V_v2/netlist/RISC_V_v2.v
write_sdf ./reports/RISC_V_v2/netlist/RISC_V_v2.sdf
write_sdc ./reports/RISC_V_v2/netlist/RISC_V_v2.sdc
write -hierarchy -format ddc -output ./reports/RISC_V_v1/ddc/RISC_V_v2.ddc
quit


